KevlnlOl7/SteadyHope/algorithms/handoff/test/test_stm32_tb6612_hal.c
#include "stm32_tb6612_hal.h"

#include <stdint.h>
#include <stdio.h>
#include <string.h>

typedef enum {
    EVENT_GPIO = 1,
    EVENT_COMPARE = 2,
    EVENT_PWM_START = 3
} EventKind;

typedef enum {
    IRQ_EVENT_GET_PRIMASK = 1,
    IRQ_EVENT_DISABLE = 2,
    IRQ_EVENT_BARRIER = 3,
    IRQ_EVENT_RESTORE_PRIMASK = 4,
    IRQ_EVENT_REQUEST = 5,
    IRQ_EVENT_HANDLER_ENTER = 6,
    IRQ_EVENT_HANDLER_EXIT = 7
} IrqEventKind;

typedef enum {
    PENDING_OPERATION_NONE = 0,
    PENDING_OPERATION_FORCE_SAFE = 1,
    PENDING_OPERATION_APPLY = 2
} PendingOperationKind;

typedef struct {
    EventKind kind;
    uint32_t object;
    uint32_t argument;
    uint32_t value;
} TestEvent;

#define MAX_EVENTS 64U
#define MAX_IRQ_EVENTS 128U

static TestEvent events[MAX_EVENTS];
static uint32_t event_count;
static IrqEventKind irq_events[MAX_IRQ_EVENTS];
static uint32_t irq_event_values[MAX_IRQ_EVENTS];
static uint32_t irq_event_count;
static uint32_t fake_primask;
static PendingOperationKind pending_operation;
static Stm32Tb6612Hal *pending_adapter;
static Tb6612Output pending_output;
static HAL_StatusTypeDef pending_status;
static uint32_t pending_service_count;
static uint32_t trigger_event_count;
static PendingOperationKind trigger_operation;
static Stm32Tb6612Hal *trigger_adapter;
static Tb6612Output trigger_output;
static HAL_StatusTypeDef pwm_start_result = HAL_OK;

static TIM_TypeDef timer_instance;
static TIM_HandleTypeDef timer_handle;
static GPIO_TypeDef ain1_port;
static GPIO_TypeDef ain2_port;
static GPIO_TypeDef stby_port;

static void service_pending_operation(void);

static void append_irq_event(IrqEventKind kind, uint32_t value)
{
    if (irq_event_count < MAX_IRQ_EVENTS) {
        irq_events[irq_event_count] = kind;
        irq_event_values[irq_event_count] = value;
        irq_event_count++;
    }
}

static void reset_fake_hal(void)
{
    memset(events, 0, sizeof(events));
    memset(irq_events, 0, sizeof(irq_events));
    memset(irq_event_values, 0, sizeof(irq_event_values));
    event_count = 0U;
    irq_event_count = 0U;
    fake_primask = 0U;
    pending_operation = PENDING_OPERATION_NONE;
    pending_adapter = NULL;
    memset(&pending_output, 0, sizeof(pending_output));
    pending_status = HAL_BUSY;
    pending_service_count = 0U;
    trigger_event_count = 0U;
    trigger_operation = PENDING_OPERATION_NONE;
    trigger_adapter = NULL;
    memset(&trigger_output, 0, sizeof(trigger_output));
    pwm_start_result = HAL_OK;
}

static void request_triggered_operation(void)
{
    if ((trigger_operation == PENDING_OPERATION_NONE) ||
        (event_count != trigger_event_count)) {
        return;
    }
    pending_operation = trigger_operation;
    pending_adapter = trigger_adapter;
    pending_output = trigger_output;
    trigger_operation = PENDING_OPERATION_NONE;
    append_irq_event(IRQ_EVENT_REQUEST,
                     (uint32_t)pending_operation);
    service_pending_operation();
}

static void append_event(EventKind kind,
                         uint32_t object,
                         uint32_t argument,
                         uint32_t value)
{
    if (event_count < MAX_EVENTS) {
        events[event_count].kind = kind;
        events[event_count].object = object;
        events[event_count].argument = argument;
        events[event_count].value = value;
        event_count++;
    }
    request_triggered_operation();
}

uint32_t __get_PRIMASK(void)
{
    append_irq_event(IRQ_EVENT_GET_PRIMASK, fake_primask);
    return fake_primask;
}

void __disable_irq(void)
{
    fake_primask = 1U;
    append_irq_event(IRQ_EVENT_DISABLE, fake_primask);
}

void __DMB(void)
{
    append_irq_event(IRQ_EVENT_BARRIER, fake_primask);
}

void __set_PRIMASK(uint32_t primask)
{
    fake_primask = primask & 1U;
    append_irq_event(IRQ_EVENT_RESTORE_PRIMASK, fake_primask);
    service_pending_operation();
}

static void service_pending_operation(void)
{
    PendingOperationKind operation;
    Stm32Tb6612Hal *adapter;
    Tb6612Output output;

    if ((fake_primask != 0U) ||
        (pending_operation == PENDING_OPERATION_NONE)) {
        return;
    }
    operation = pending_operation;
    adapter = pending_adapter;
    output = pending_output;
    pending_operation = PENDING_OPERATION_NONE;
    pending_adapter = NULL;
    pending_service_count++;
    append_irq_event(IRQ_EVENT_HANDLER_ENTER, (uint32_t)operation);
    if (operation == PENDING_OPERATION_FORCE_SAFE) {
        pending_status = STM32_TB6612_HAL_ForceSafe(adapter);
    } else {
        pending_status = STM32_TB6612_HAL_Apply(adapter, &output);
    }
    append_irq_event(IRQ_EVENT_HANDLER_EXIT, (uint32_t)operation);
}

static void arm_operation_after_hardware_event(
    uint32_t hardware_event_count,
    PendingOperationKind operation,
    Stm32Tb6612Hal *adapter,
    const Tb6612Output *output)
{
    trigger_event_count = hardware_event_count;
    trigger_operation = operation;
    trigger_adapter = adapter;
    memset(&trigger_output, 0, sizeof(trigger_output));
    if (output != NULL) {
        trigger_output = *output;
    }
}

HAL_StatusTypeDef HAL_TIM_PWM_Start(TIM_HandleTypeDef *timer,
                                    uint32_t channel)
{
    append_event(EVENT_PWM_START,
                 (uint32_t)(timer == &timer_handle), channel, 0U);
    return pwm_start_result;
}

void HAL_GPIO_WritePin(GPIO_TypeDef *port,
                       uint16_t pin,
                       GPIO_PinState state)
{
    append_event(EVENT_GPIO, port->test_id, (uint32_t)pin,
                 (uint32_t)state);
}

void FakeHal_SetCompare(TIM_HandleTypeDef *timer,
                        uint32_t channel,
                        uint32_t compare)
{
    append_event(EVENT_COMPARE,
                 (uint32_t)(timer == &timer_handle), channel, compare);
}

static Stm32Tb6612HalConfig valid_hal_config(void)
{
    Stm32Tb6612HalConfig config;

    timer_instance.ARR = 3199U;
    timer_handle.Instance = &timer_instance;
    ain1_port.test_id = 1U;
    ain2_port.test_id = 2U;
    stby_port.test_id = 3U;

    config.pwm_timer = &timer_handle;
    config.pwm_channel = TIM_CHANNEL_1;
    config.pwm_full_scale_ccr = 3200U;
    config.max_active_ccr = 800U;
    config.release_ain1_level = 1U;
    config.ain1_port = &ain1_port;
    config.ain1_pin = UINT16_C(0x0008);
    config.ain2_port = &ain2_port;
    config.ain2_pin = UINT16_C(0x0040);
    config.stby_port = &stby_port;
    config.stby_pin = UINT16_C(0x0002);
    return config;
}

static int event_equals(uint32_t index,
                        EventKind kind,
                        uint32_t object,
                        uint32_t argument,
                        uint32_t value)
{
    return (index < event_count) && (events[index].kind == kind) &&
           (events[index].object == object) &&
           (events[index].argument == argument) &&
           (events[index].value == value);
}

static int safe_sequence_at(uint32_t offset)
{
    return event_equals(offset, EVENT_GPIO, 3U, UINT16_C(0x0002),
                        (uint32_t)GPIO_PIN_RESET) &&
           event_equals(offset + 1U, EVENT_COMPARE, 1U, TIM_CHANNEL_1,
                        0U) &&
           event_equals(offset + 2U, EVENT_GPIO, 1U,
                        UINT16_C(0x0008),
                        (uint32_t)GPIO_PIN_RESET) &&
           event_equals(offset + 3U, EVENT_GPIO, 2U,
                        UINT16_C(0x0040),
                        (uint32_t)GPIO_PIN_RESET);
}

static int gpio_only_safe_sequence_at(uint32_t offset)
{
    return event_equals(offset, EVENT_GPIO, 3U, UINT16_C(0x0002),
                        (uint32_t)GPIO_PIN_RESET) &&
           event_equals(offset + 1U, EVENT_GPIO, 1U,
                        UINT16_C(0x0008),
                        (uint32_t)GPIO_PIN_RESET) &&
           event_equals(offset + 2U, EVENT_GPIO, 2U,
                        UINT16_C(0x0040),
                        (uint32_t)GPIO_PIN_RESET);
}

