KevlnlOl7/SteadyHope/algorithms/handoff/test/test_stm32_tb6612_hal.c
static int active_sequence_at(uint32_t offset, uint32_t ccr)
{
    return event_equals(offset, EVENT_COMPARE, 1U, TIM_CHANNEL_1, 0U) &&
           event_equals(offset + 1U, EVENT_GPIO, 1U,
                        UINT16_C(0x0008),
                        (uint32_t)GPIO_PIN_SET) &&
           event_equals(offset + 2U, EVENT_GPIO, 2U,
                        UINT16_C(0x0040),
                        (uint32_t)GPIO_PIN_RESET) &&
           event_equals(offset + 3U, EVENT_GPIO, 3U,
                        UINT16_C(0x0002),
                        (uint32_t)GPIO_PIN_SET) &&
           event_equals(offset + 4U, EVENT_COMPARE, 1U,
                        TIM_CHANNEL_1, ccr);
}

static uint32_t find_irq_event(IrqEventKind kind, uint32_t start)
{
    uint32_t index;

    for (index = start; index < irq_event_count; ++index) {
        if (irq_events[index] == kind) {
            return index;
        }
    }
    return UINT32_MAX;
}

static int initialize_adapter(Stm32Tb6612Hal *adapter)
{
    Stm32Tb6612HalConfig config = valid_hal_config();

    memset(adapter, 0, sizeof(*adapter));
    reset_fake_hal();
    return (STM32_TB6612_HAL_Init(adapter, &config) == HAL_OK) &&
           (event_count == 9U) && safe_sequence_at(0U) &&
           event_equals(4U, EVENT_PWM_START, 1U, TIM_CHANNEL_1, 0U) &&
           safe_sequence_at(5U) && (adapter->initialized == 1U) &&
           (adapter->last_active_direction == 0) &&
           (adapter->config_guard[0] != adapter->config_guard[1]) &&
           (adapter->initialized_config_guard[0] !=
            adapter->initialized_config_guard[1]) &&
           (adapter->expected_pwm_instance_guard[0] !=
            adapter->expected_pwm_instance_guard[1]) &&
           ((adapter->config_guard[0] !=
             adapter->initialized_config_guard[0]) ||
            (adapter->config_guard[1] !=
             adapter->initialized_config_guard[1]));
}

static int test_init_and_timer_contract(void)
{
    Stm32Tb6612Hal adapter;
    Stm32Tb6612HalConfig config = valid_hal_config();

    if ((STM32_TB6612_HAL_ConfigIsValid(&config) == 0U) ||
        !initialize_adapter(&adapter)) {
        return 0;
    }

    config = valid_hal_config();
    config.pwm_full_scale_ccr = 3199U;
    if (STM32_TB6612_HAL_ConfigIsValid(&config) != 0U) {
        return 0;
    }
    config = valid_hal_config();
    config.max_active_ccr = 0U;
    if (STM32_TB6612_HAL_ConfigIsValid(&config) == 0U) {
        return 0;
    }
    config = valid_hal_config();
    config.max_active_ccr = 3201U;
    if (STM32_TB6612_HAL_ConfigIsValid(&config) != 0U) {
        return 0;
    }
    config = valid_hal_config();
    config.release_ain1_level = 2U;
    if (STM32_TB6612_HAL_ConfigIsValid(&config) != 0U) {
        return 0;
    }
    config = valid_hal_config();
    config.ain2_port = config.ain1_port;
    config.ain2_pin = config.ain1_pin;
    if (STM32_TB6612_HAL_ConfigIsValid(&config) != 0U) {
        return 0;
    }

    config = valid_hal_config();
    memset(&adapter, 0, sizeof(adapter));
    reset_fake_hal();
    pwm_start_result = HAL_ERROR;
    if ((STM32_TB6612_HAL_Init(&adapter, &config) != HAL_ERROR) ||
        (adapter.initialized != 0U) || (event_count != 9U) ||
        !safe_sequence_at(0U) || !safe_sequence_at(5U)) {
        return 0;
    }
    return 1;
}

static int test_active_and_safe_apply_order(void)
{
    Stm32Tb6612Hal adapter;
    Tb6612Output output;

    if (!initialize_adapter(&adapter)) {
        return 0;
    }
    memset(&output, 0, sizeof(output));
    output.ccr = 320U;
    output.direction = 1;
    output.ain1 = 1U;
    output.ain2 = 0U;
    output.stby = 1U;
    output.fault = (uint8_t)TB6612_DRIVER_FAULT_NONE;

    reset_fake_hal();
    if ((STM32_TB6612_HAL_Apply(&adapter, &output) != HAL_OK) ||
        (event_count != 5U) ||
        !event_equals(0U, EVENT_COMPARE, 1U, TIM_CHANNEL_1, 0U) ||
        !event_equals(1U, EVENT_GPIO, 1U, UINT16_C(0x0008),
                      (uint32_t)GPIO_PIN_SET) ||
        !event_equals(2U, EVENT_GPIO, 2U, UINT16_C(0x0040),
                      (uint32_t)GPIO_PIN_RESET) ||
        !event_equals(3U, EVENT_GPIO, 3U, UINT16_C(0x0002),
                      (uint32_t)GPIO_PIN_SET) ||
        !event_equals(4U, EVENT_COMPARE, 1U, TIM_CHANNEL_1, 320U)) {
        return 0;
    }

    memset(&output, 0, sizeof(output));
    reset_fake_hal();
    return (STM32_TB6612_HAL_Apply(&adapter, &output) == HAL_OK) &&
           (event_count == 4U) && safe_sequence_at(0U);
}

static int test_malformed_and_mutated_state_force_safe(void)
{
    Stm32Tb6612Hal adapter;
    Tb6612Output output;

    if (!initialize_adapter(&adapter)) {
        return 0;
    }
    memset(&output, 0, sizeof(output));
    output.ccr = 320U;
    output.direction = 1;
    output.ain1 = 1U;
    output.ain2 = 1U;
    output.stby = 1U;

    reset_fake_hal();
    if ((STM32_TB6612_HAL_Apply(&adapter, &output) != HAL_ERROR) ||
        (event_count != 4U) || !safe_sequence_at(0U)) {
        return 0;
    }

    memset(&output, 0, sizeof(output));
    output.fault = (uint8_t)TB6612_DRIVER_FAULT_DUTY;
    reset_fake_hal();
    if ((STM32_TB6612_HAL_Apply(&adapter, &output) != HAL_ERROR) ||
        (event_count != 4U) || !safe_sequence_at(0U)) {
        return 0;
    }

    adapter.config.stby_pin = adapter.config.ain1_pin;
    adapter.config.stby_port = adapter.config.ain1_port;
    reset_fake_hal();
    if ((STM32_TB6612_HAL_Apply(&adapter, &output) != HAL_ERROR) ||
        (event_count != 4U) || !safe_sequence_at(0U)) {
        return 0;
    }

    timer_instance.ARR = 2999U;
    reset_fake_hal();
    return (STM32_TB6612_HAL_ForceSafe(&adapter) == HAL_ERROR) &&
           (event_count == 4U) && safe_sequence_at(0U);
}

static int test_direction_polarity_and_transition_guard(void)
{
    Stm32Tb6612Hal adapter;
    Tb6612Output output;

    if (!initialize_adapter(&adapter)) {
        return 0;
    }
    memset(&output, 0, sizeof(output));
    output.ccr = 320U;
    output.direction = 1;
    output.ain1 = 0U;
    output.ain2 = 1U;
    output.stby = 1U;

    /* The pins encode take-up while the authority field says release. */
    reset_fake_hal();
    if ((STM32_TB6612_HAL_Apply(&adapter, &output) != HAL_ERROR) ||
        (event_count != 4U) || !safe_sequence_at(0U) ||
        (adapter.last_active_direction != 0)) {
        return 0;
    }

    output.ain1 = 1U;
    output.ain2 = 0U;
    reset_fake_hal();
    if ((STM32_TB6612_HAL_Apply(&adapter, &output) != HAL_OK) ||
        (adapter.last_active_direction != 1)) {
        return 0;
    }

    output.direction = -1;
    output.ain1 = 0U;
    output.ain2 = 1U;
    reset_fake_hal();
    if ((STM32_TB6612_HAL_Apply(&adapter, &output) != HAL_ERROR) ||
        (event_count != 4U) || !safe_sequence_at(0U) ||
        (adapter.last_active_direction != 1)) {
        return 0;
    }

    /* A rejected reversal cannot itself authorize the next reversal. */
    reset_fake_hal();
    if ((STM32_TB6612_HAL_Apply(&adapter, &output) != HAL_ERROR) ||
        (event_count != 4U) || !safe_sequence_at(0U) ||
        (adapter.last_active_direction != 1)) {
        return 0;
    }

    memset(&output, 0, sizeof(output));
    reset_fake_hal();
    if ((STM32_TB6612_HAL_Apply(&adapter, &output) != HAL_OK) ||
        (event_count != 4U) || !safe_sequence_at(0U) ||
        (adapter.last_active_direction != 0)) {
        return 0;
    }

    output.ccr = 320U;
    output.direction = -1;
    output.ain1 = 0U;
    output.ain2 = 1U;
    output.stby = 1U;
    reset_fake_hal();
    return (STM32_TB6612_HAL_Apply(&adapter, &output) == HAL_OK) &&
           (event_count == 5U) &&
           (adapter.last_active_direction == -1);
}

static int test_runtime_state_corruption_latches_safe(void)
{
    Stm32Tb6612Hal adapter;
    Tb6612Output output;

    memset(&output, 0, sizeof(output));
    output.ccr = 320U;
    output.direction = 1;
    output.ain1 = 1U;
    output.ain2 = 0U;
    output.stby = 1U;

    if (!initialize_adapter(&adapter)) {
        return 0;
    }
    adapter.last_active_direction = 2;
    reset_fake_hal();
    if ((STM32_TB6612_HAL_Apply(&adapter, &output) != HAL_ERROR) ||
        (event_count != 4U) || !safe_sequence_at(0U) ||
        (adapter.initialized != 0U)) {
        return 0;
    }

    if (!initialize_adapter(&adapter)) {
        return 0;
    }
    adapter.runtime_guard[0] ^= UINT64_C(1);
    reset_fake_hal();
    if ((STM32_TB6612_HAL_Apply(&adapter, &output) != HAL_ERROR) ||
        (event_count != 4U) || !safe_sequence_at(0U) ||
        (adapter.initialized != 0U)) {
        return 0;
    }

    if (!initialize_adapter(&adapter)) {
        return 0;
    }
    adapter.config.release_ain1_level = 0U;
    reset_fake_hal();
    return (STM32_TB6612_HAL_Apply(&adapter, &output) == HAL_ERROR) &&
           (event_count == 4U) && safe_sequence_at(0U) &&
           (adapter.initialized == 0U);
}

static int test_force_safe_does_not_reauthorize_corruption(void)
{
    Stm32Tb6612Hal adapter;

    if (!initialize_adapter(&adapter)) {
        return 0;
    }
    adapter.last_active_direction = 2;
    reset_fake_hal();
    if ((STM32_TB6612_HAL_ForceSafe(&adapter) != HAL_ERROR) ||
        (event_count != 4U) || !safe_sequence_at(0U) ||
        (adapter.initialized != 0U) ||
        (adapter.last_active_direction != 0)) {
        return 0;
    }

    if (!initialize_adapter(&adapter)) {
        return 0;
    }
    adapter.runtime_guard[1] ^= UINT64_C(1);
    reset_fake_hal();
    if ((STM32_TB6612_HAL_ForceSafe(&adapter) != HAL_ERROR) ||
        (event_count != 4U) || !safe_sequence_at(0U) ||
        (adapter.initialized != 0U) ||
        (adapter.last_active_direction != 0)) {
        return 0;
    }

    if (!initialize_adapter(&adapter)) {
        return 0;
    }
    adapter.config.release_ain1_level = 0U;
    reset_fake_hal();
    return (STM32_TB6612_HAL_ForceSafe(&adapter) == HAL_ERROR) &&
           (event_count == 4U) && safe_sequence_at(0U) &&
           (adapter.initialized == 0U) &&
           (adapter.last_active_direction == 0);
}

static int test_integer_active_cap_is_independent_fail_closed_limit(void)
{
    Stm32Tb6612Hal adapter;
    Stm32Tb6612HalConfig config = valid_hal_config();
    Tb6612Output output;

    memset(&output, 0, sizeof(output));
    output.ccr = 1U;
    output.direction = 1;
    output.ain1 = 1U;
    output.ain2 = 0U;
    output.stby = 1U;

