KevlnlOl7/SteadyHope/algorithms/handoff/test/test_stm32_tb6612_hal.c
    /* Zero is a supported motor-locked HAL configuration. */
    config.max_active_ccr = 0U;
    memset(&adapter, 0, sizeof(adapter));
    reset_fake_hal();
    if ((STM32_TB6612_HAL_Init(&adapter, &config) != HAL_OK) ||
        (STM32_TB6612_HAL_Apply(&adapter, &output) != HAL_ERROR) ||
        (event_count != 13U) || !safe_sequence_at(9U) ||
        (adapter.initialized != 1U) ||
        (adapter.last_active_direction != 0)) {
        return 0;
    }

    memset(&output, 0, sizeof(output));
    reset_fake_hal();
    if ((STM32_TB6612_HAL_Apply(&adapter, &output) != HAL_OK) ||
        (event_count != 4U) || !safe_sequence_at(0U)) {
        return 0;
    }

    config = valid_hal_config();
    config.max_active_ccr = 400U;
    reset_fake_hal();
    if (STM32_TB6612_HAL_Init(&adapter, &config) != HAL_OK) {
        return 0;
    }
    memset(&output, 0, sizeof(output));
    output.ccr = 400U;
    output.direction = 1;
    output.ain1 = 1U;
    output.ain2 = 0U;
    output.stby = 1U;
    reset_fake_hal();
    if ((STM32_TB6612_HAL_Apply(&adapter, &output) != HAL_OK) ||
        (event_count != 5U)) {
        return 0;
    }

    output.ccr = 401U;
    reset_fake_hal();
    if ((STM32_TB6612_HAL_Apply(&adapter, &output) != HAL_ERROR) ||
        (event_count != 4U) || !safe_sequence_at(0U) ||
        (adapter.initialized != 1U)) {
        return 0;
    }

    adapter.config.max_active_ccr = 399U;
    reset_fake_hal();
    return (STM32_TB6612_HAL_Apply(&adapter, &output) == HAL_ERROR) &&
           (event_count == 4U) && safe_sequence_at(0U) &&
           (adapter.initialized == 0U);
}

static int test_config_snapshot_integrity_precedes_pointer_use(void)
{
    Stm32Tb6612Hal adapter;
    Tb6612Output safe_output;

    memset(&safe_output, 0, sizeof(safe_output));

    if (!initialize_adapter(&adapter)) {
        return 0;
    }
    adapter.initialized_config.pwm_timer =
        (TIM_HandleTypeDef *)(uintptr_t)1U;
    reset_fake_hal();
    if ((STM32_TB6612_HAL_Apply(&adapter, &safe_output) != HAL_ERROR) ||
        (event_count != 4U) || !safe_sequence_at(0U) ||
        (adapter.initialized != 0U)) {
        return 0;
    }

    if (!initialize_adapter(&adapter)) {
        return 0;
    }
    adapter.initialized_config.ain1_pin = 0U;
    reset_fake_hal();
    if ((STM32_TB6612_HAL_ForceSafe(&adapter) != HAL_ERROR) ||
        (event_count != 4U) || !safe_sequence_at(0U) ||
        (adapter.initialized != 0U)) {
        return 0;
    }

    if (!initialize_adapter(&adapter)) {
        return 0;
    }
    adapter.config.pwm_timer = (TIM_HandleTypeDef *)(uintptr_t)1U;
    reset_fake_hal();
    if ((STM32_TB6612_HAL_ForceSafe(&adapter) != HAL_ERROR) ||
        (event_count != 4U) || !safe_sequence_at(0U) ||
        (adapter.initialized != 0U)) {
        return 0;
    }

    if (!initialize_adapter(&adapter)) {
        return 0;
    }
    adapter.config.stby_pin = 0U;
    reset_fake_hal();
    if ((STM32_TB6612_HAL_Apply(&adapter, &safe_output) != HAL_ERROR) ||
        (event_count != 4U) || !safe_sequence_at(0U) ||
        (adapter.initialized != 0U)) {
        return 0;
    }

    if (!initialize_adapter(&adapter)) {
        return 0;
    }
    adapter.initialized_config_guard[0] ^= UINT64_C(1);
    reset_fake_hal();
    if ((STM32_TB6612_HAL_Apply(&adapter, &safe_output) != HAL_ERROR) ||
        (event_count != 4U) || !safe_sequence_at(0U) ||
        (adapter.initialized != 0U)) {
        return 0;
    }

    if (!initialize_adapter(&adapter)) {
        return 0;
    }
    adapter.config_guard[1] ^= UINT64_C(1);
    reset_fake_hal();
    if ((STM32_TB6612_HAL_ForceSafe(&adapter) != HAL_ERROR) ||
        (event_count != 4U) || !safe_sequence_at(0U) ||
        (adapter.initialized != 0U)) {
        return 0;
    }

    if (!initialize_adapter(&adapter)) {
        return 0;
    }
    adapter.initialized_config_guard[0] ^= UINT64_C(1);
    adapter.config_guard[0] ^= UINT64_C(1);
    reset_fake_hal();
    return (STM32_TB6612_HAL_ForceSafe(&adapter) == HAL_ERROR) &&
           (event_count == 0U) && (adapter.initialized == 0U) &&
           (adapter.last_active_direction == 0);
}

static int test_mutated_timer_instance_uses_gpio_only_safe_path(void)
{
    Stm32Tb6612Hal adapter;
    Tb6612Output output;

    memset(&output, 0, sizeof(output));
    output.ccr = 320U;
    output.direction = 1;
    output.ain1 = 1U;
    output.ain2 = 0U;
    output.stby = 1U;

    if (!initialize_adapter(&adapter)) {
        return 0;
    }
    reset_fake_hal();
    if (STM32_TB6612_HAL_Apply(&adapter, &output) != HAL_OK) {
        return 0;
    }
    timer_handle.Instance = (TIM_TypeDef *)(uintptr_t)1U;
    memset(&output, 0, sizeof(output));
    reset_fake_hal();
    if ((STM32_TB6612_HAL_Apply(&adapter, &output) != HAL_ERROR) ||
        (event_count != 3U) || !gpio_only_safe_sequence_at(0U) ||
        (adapter.initialized != 0U)) {
        return 0;
    }

    if (!initialize_adapter(&adapter)) {
        return 0;
    }
    memset(&output, 0, sizeof(output));
    output.ccr = 320U;
    output.direction = 1;
    output.ain1 = 1U;
    output.ain2 = 0U;
    output.stby = 1U;
    reset_fake_hal();
    if (STM32_TB6612_HAL_Apply(&adapter, &output) != HAL_OK) {
        return 0;
    }
    timer_handle.Instance = NULL;
    reset_fake_hal();
    if ((STM32_TB6612_HAL_ForceSafe(&adapter) != HAL_ERROR) ||
        (event_count != 3U) || !gpio_only_safe_sequence_at(0U) ||
        (adapter.initialized != 0U)) {
        return 0;
    }

    if (!initialize_adapter(&adapter)) {
        return 0;
    }
    adapter.expected_pwm_instance_guard[0] ^= UINT64_C(1);
    reset_fake_hal();
    return (STM32_TB6612_HAL_ForceSafe(&adapter) == HAL_ERROR) &&
           (event_count == 3U) && gpio_only_safe_sequence_at(0U) &&
           (adapter.initialized == 0U);
}

static void corrupt_lifecycle_marker(Stm32Tb6612Hal *adapter,
                                     uint32_t marker)
{
    if (marker == 0U) {
        adapter->lifecycle_magic ^= UINT64_C(1);
    } else if (marker == 1U) {
        adapter->lifecycle_guard[0] ^= UINT64_C(1);
    } else if (marker == 2U) {
        adapter->lifecycle_guard[1] ^= UINT64_C(1);
    } else {
        adapter->lifecycle_magic = 0U;
        adapter->lifecycle_guard[0] = 0U;
        adapter->lifecycle_guard[1] = 0U;
    }
}

static int exercise_corrupt_lifecycle_safe_attempt(uint32_t marker,
                                                   uint8_t use_apply)
{
    Stm32Tb6612Hal adapter;
    Tb6612Output output;
    HAL_StatusTypeDef status;

    if (!initialize_adapter(&adapter)) {
        return 0;
    }
    memset(&output, 0, sizeof(output));
    output.ccr = 320U;
    output.direction = 1;
    output.ain1 = 1U;
    output.ain2 = 0U;
    output.stby = 1U;
    reset_fake_hal();
    if (STM32_TB6612_HAL_Apply(&adapter, &output) != HAL_OK) {
        return 0;
    }

    corrupt_lifecycle_marker(&adapter, marker);
    reset_fake_hal();
    status = (use_apply != 0U) ?
             STM32_TB6612_HAL_Apply(&adapter, &output) :
             STM32_TB6612_HAL_ForceSafe(&adapter);
    return (status == HAL_ERROR) && (event_count == 4U) &&
           safe_sequence_at(0U) && (adapter.initialized == 0U) &&
           (adapter.last_active_direction == 0) &&
           (adapter.config.max_active_ccr == 800U);
}

static int test_corrupt_lifecycle_never_blocks_safe_attempt(void)
{
    uint32_t marker;

