KevlnlOl7/SteadyHope/algorithms/handoff/test/test_stm32_tb6612_hal.c
    for (marker = 0U; marker < 4U; ++marker) {
        if (!exercise_corrupt_lifecycle_safe_attempt(marker, 0U) ||
            !exercise_corrupt_lifecycle_safe_attempt(marker, 1U)) {
            return 0;
        }
    }
    return 1;
}

static int test_reinit_safes_live_adapter_before_validation(void)
{
    Stm32Tb6612Hal adapter;
    Stm32Tb6612HalConfig invalid_config = valid_hal_config();
    Stm32Tb6612HalConfig valid_config = valid_hal_config();
    Tb6612Output output;

    if (!initialize_adapter(&adapter)) {
        return 0;
    }
    memset(&output, 0, sizeof(output));
    output.ccr = 320U;
    output.direction = 1;
    output.ain1 = 1U;
    output.ain2 = 0U;
    output.stby = 1U;
    reset_fake_hal();
    if (STM32_TB6612_HAL_Apply(&adapter, &output) != HAL_OK) {
        return 0;
    }

    invalid_config.max_active_ccr =
        invalid_config.pwm_full_scale_ccr + 1U;
    reset_fake_hal();
    if ((STM32_TB6612_HAL_Init(&adapter, &invalid_config) != HAL_ERROR) ||
        (event_count != 4U) || !safe_sequence_at(0U) ||
        (adapter.initialized != 0U) ||
        (adapter.config.max_active_ccr != 800U)) {
        return 0;
    }

    if (STM32_TB6612_HAL_Init(&adapter, &valid_config) != HAL_OK) {
        return 0;
    }
    memset(&output, 0, sizeof(output));
    output.ccr = 320U;
    output.direction = 1;
    output.ain1 = 1U;
    output.ain2 = 0U;
    output.stby = 1U;
    reset_fake_hal();
    if (STM32_TB6612_HAL_Apply(&adapter, &output) != HAL_OK) {
        return 0;
    }
    adapter.lifecycle_magic = 0U;
    adapter.lifecycle_guard[0] = 0U;
    adapter.lifecycle_guard[1] = 0U;
    reset_fake_hal();
    if ((STM32_TB6612_HAL_Init(&adapter, &invalid_config) != HAL_ERROR) ||
        (event_count != 4U) || !safe_sequence_at(0U) ||
        (adapter.initialized != 0U) ||
        (adapter.config.max_active_ccr != 800U)) {
        return 0;
    }

    /* A recognizable corrupt live identity is never erased in-place. */
    if (!initialize_adapter(&adapter)) {
        return 0;
    }
    adapter.lifecycle_guard[0] ^= UINT64_C(1);
    reset_fake_hal();
    if ((STM32_TB6612_HAL_Init(&adapter, &valid_config) != HAL_ERROR) ||
        (event_count != 4U) || !safe_sequence_at(0U) ||
        (adapter.initialized != 0U) ||
        (adapter.lifecycle_magic == 0U)) {
        return 0;
    }

    /* Truly fresh objects never cause speculative GPIO or timer writes. */
    memset(&adapter, 0, sizeof(adapter));
    reset_fake_hal();
    if ((STM32_TB6612_HAL_ForceSafe(&adapter) != HAL_ERROR) ||
        (event_count != 0U)) {
        return 0;
    }
    memset(&adapter, 0xA5, sizeof(adapter));
    memset(&output, 0, sizeof(output));
    reset_fake_hal();
    if ((STM32_TB6612_HAL_Apply(&adapter, &output) != HAL_ERROR) ||
        (event_count != 0U)) {
        return 0;
    }

    /* Non-matching stack bytes remain a valid first-Init input. */
    memset(&adapter, 0xA5, sizeof(adapter));
    reset_fake_hal();
    return (STM32_TB6612_HAL_Init(&adapter, &valid_config) == HAL_OK) &&
           (event_count == 9U) && safe_sequence_at(0U) &&
           safe_sequence_at(5U) && (adapter.initialized == 1U);
}

static int single_critical_section_restored(uint32_t original_primask)
{
    return (irq_event_count >= 5U) &&
           (irq_events[0] == IRQ_EVENT_GET_PRIMASK) &&
           (irq_event_values[0] == original_primask) &&
           (irq_events[1] == IRQ_EVENT_DISABLE) &&
           (irq_events[2] == IRQ_EVENT_BARRIER) &&
           (irq_events[irq_event_count - 2U] == IRQ_EVENT_BARRIER) &&
           (irq_events[irq_event_count - 1U] ==
            IRQ_EVENT_RESTORE_PRIMASK) &&
           (irq_event_values[irq_event_count - 1U] ==
            original_primask) &&
           (fake_primask == original_primask);
}

static int test_primask_restore_on_apply_and_force_safe_paths(void)
{
    uint32_t original_primask;

    for (original_primask = 0U;
         original_primask <= 1U;
         ++original_primask) {
        Stm32Tb6612Hal adapter;
        Tb6612Output output;

        if (!initialize_adapter(&adapter)) {
            return 0;
        }
        memset(&output, 0, sizeof(output));
        output.ccr = 320U;
        output.direction = 1;
        output.ain1 = 1U;
        output.ain2 = 0U;
        output.stby = 1U;
        reset_fake_hal();
        fake_primask = original_primask;
        if ((STM32_TB6612_HAL_Apply(&adapter, &output) != HAL_OK) ||
            (event_count != 5U) || !active_sequence_at(0U, 320U) ||
            !single_critical_section_restored(original_primask)) {
            return 0;
        }

        memset(&output, 0, sizeof(output));
        reset_fake_hal();
        fake_primask = original_primask;
        if ((STM32_TB6612_HAL_Apply(&adapter, &output) != HAL_OK) ||
            (event_count != 4U) || !safe_sequence_at(0U) ||
            !single_critical_section_restored(original_primask)) {
            return 0;
        }

        output.ccr = 801U;
        output.direction = 1;
        output.ain1 = 1U;
        output.stby = 1U;
        reset_fake_hal();
        fake_primask = original_primask;
        if ((STM32_TB6612_HAL_Apply(&adapter, &output) != HAL_ERROR) ||
            (event_count != 4U) || !safe_sequence_at(0U) ||
            !single_critical_section_restored(original_primask)) {
            return 0;
        }

        reset_fake_hal();
        fake_primask = original_primask;
        if ((STM32_TB6612_HAL_ForceSafe(&adapter) != HAL_OK) ||
            (event_count != 4U) || !safe_sequence_at(0U) ||
            !single_critical_section_restored(original_primask)) {
            return 0;
        }

        if (!initialize_adapter(&adapter)) {
            return 0;
        }
        reset_fake_hal();
        fake_primask = original_primask;
        if ((STM32_TB6612_HAL_Apply(&adapter, NULL) != HAL_ERROR) ||
            (event_count != 4U) || !safe_sequence_at(0U) ||
            !single_critical_section_restored(original_primask)) {
            return 0;
        }

        reset_fake_hal();
        fake_primask = original_primask;
        if ((STM32_TB6612_HAL_Apply(NULL, &output) != HAL_ERROR) ||
            (event_count != 0U) ||
            !single_critical_section_restored(original_primask)) {
            return 0;
        }

        reset_fake_hal();
        fake_primask = original_primask;
        if ((STM32_TB6612_HAL_ForceSafe(NULL) != HAL_ERROR) ||
            (event_count != 0U) ||
            !single_critical_section_restored(original_primask)) {
            return 0;
        }
    }
    return 1;
}

static int test_init_restores_original_primask_on_all_outcomes(void)
{
    uint32_t original_primask;

    for (original_primask = 0U;
         original_primask <= 1U;
         ++original_primask) {
        Stm32Tb6612Hal adapter;
        Stm32Tb6612HalConfig config = valid_hal_config();

        memset(&adapter, 0, sizeof(adapter));
        reset_fake_hal();
        fake_primask = original_primask;
        if ((STM32_TB6612_HAL_Init(&adapter, &config) != HAL_OK) ||
            (event_count != 9U) || !safe_sequence_at(0U) ||
            !safe_sequence_at(5U) ||
            !single_critical_section_restored(original_primask)) {
            return 0;
        }

        memset(&adapter, 0, sizeof(adapter));
        config.max_active_ccr = config.pwm_full_scale_ccr + 1U;
        reset_fake_hal();
        fake_primask = original_primask;
        if ((STM32_TB6612_HAL_Init(&adapter, &config) != HAL_ERROR) ||
            (event_count != 4U) || !safe_sequence_at(0U) ||
            !single_critical_section_restored(original_primask)) {
            return 0;
        }

        config = valid_hal_config();
        memset(&adapter, 0, sizeof(adapter));
        reset_fake_hal();
        pwm_start_result = HAL_ERROR;
        fake_primask = original_primask;
        if ((STM32_TB6612_HAL_Init(&adapter, &config) != HAL_ERROR) ||
            (event_count != 9U) || !safe_sequence_at(0U) ||
            !safe_sequence_at(5U) ||
            !single_critical_section_restored(original_primask)) {
            return 0;
        }

        reset_fake_hal();
        fake_primask = original_primask;
        if ((STM32_TB6612_HAL_Init(NULL, &config) != HAL_ERROR) ||
            (event_count != 0U) ||
            !single_critical_section_restored(original_primask)) {
            return 0;
        }
    }
    return 1;
}

static int test_pending_force_safe_runs_only_after_active_apply_commit(void)
{
    uint32_t trigger;

    for (trigger = 1U; trigger <= 5U; ++trigger) {
        Stm32Tb6612Hal adapter;
        Tb6612Output output;
        uint32_t request_index;
        uint32_t restore_index;
        uint32_t handler_index;

        if (!initialize_adapter(&adapter)) {
            return 0;
        }
        memset(&output, 0, sizeof(output));
        output.ccr = 320U;
        output.direction = 1;
        output.ain1 = 1U;
        output.ain2 = 0U;
        output.stby = 1U;
        reset_fake_hal();
        arm_operation_after_hardware_event(
            trigger, PENDING_OPERATION_FORCE_SAFE, &adapter, NULL);
        if ((STM32_TB6612_HAL_Apply(&adapter, &output) != HAL_OK) ||
            (event_count != 9U) || !active_sequence_at(0U, 320U) ||
            !safe_sequence_at(5U) ||
            (pending_service_count != 1U) ||
            (pending_status != HAL_OK) ||
            (fake_primask != 0U) ||
            (adapter.initialized != 1U) ||
            (adapter.last_active_direction != 0)) {
            return 0;
        }

        request_index = find_irq_event(IRQ_EVENT_REQUEST, 0U);
        restore_index = find_irq_event(IRQ_EVENT_RESTORE_PRIMASK,
                                       request_index + 1U);
        handler_index = find_irq_event(IRQ_EVENT_HANDLER_ENTER,
                                       request_index + 1U);
        if ((request_index == UINT32_MAX) ||
            (restore_index == UINT32_MAX) ||
            (handler_index == UINT32_MAX) ||
            (request_index >= restore_index) ||
            (restore_index >= handler_index)) {
            return 0;
        }
    }
    return 1;
}

static int test_reverse_pending_apply_is_linearized_after_safe_operation(void)
{
    Stm32Tb6612Hal adapter;
    Stm32Tb6612HalConfig invalid_config;
    Tb6612Output output;

    if (!initialize_adapter(&adapter)) {
        return 0;
    }
    memset(&output, 0, sizeof(output));
    output.ccr = 320U;
    output.direction = 1;
    output.ain1 = 1U;
    output.ain2 = 0U;
    output.stby = 1U;
    reset_fake_hal();
    if (STM32_TB6612_HAL_Apply(&adapter, &output) != HAL_OK) {
        return 0;
    }

    reset_fake_hal();
    arm_operation_after_hardware_event(
        4U, PENDING_OPERATION_APPLY, &adapter, &output);
    if ((STM32_TB6612_HAL_ForceSafe(&adapter) != HAL_OK) ||
        (event_count != 9U) || !safe_sequence_at(0U) ||
        !active_sequence_at(4U, 320U) ||
        (pending_service_count != 1U) ||
        (pending_status != HAL_OK) ||
        (adapter.last_active_direction != 1) ||
        (fake_primask != 0U)) {
        return 0;
    }

