KevlnlOl7/SteadyHope/algorithms/handoff/test/test_stm32_tb6612_hal.c
    /*
     * Invalid re-Init is a latching operation.  A pending ACTIVE Apply is
     * delayed until Init restores PRIMASK, then rejected and forced safe.
     */
    invalid_config = valid_hal_config();
    invalid_config.max_active_ccr =
        invalid_config.pwm_full_scale_ccr + 1U;
    reset_fake_hal();
    arm_operation_after_hardware_event(
        4U, PENDING_OPERATION_APPLY, &adapter, &output);
    if ((STM32_TB6612_HAL_Init(&adapter, &invalid_config) != HAL_ERROR) ||
        (event_count != 8U) || !safe_sequence_at(0U) ||
        !safe_sequence_at(4U) ||
        (pending_service_count != 1U) ||
        (pending_status != HAL_ERROR) ||
        (adapter.initialized != 0U) ||
        (adapter.last_active_direction != 0) ||
        (fake_primask != 0U)) {
        return 0;
    }
    return 1;
}

int main(void)
{
    int pass = 1;

#define RUN_TEST(test_function) do {                                      \
        int test_passed = (test_function)();                              \
        if (!test_passed) {                                               \
            printf("FAIL: %s\n", #test_function);                        \
        }                                                                 \
        pass &= test_passed;                                              \
    } while (0)

    RUN_TEST(test_init_and_timer_contract);
    RUN_TEST(test_active_and_safe_apply_order);
    RUN_TEST(test_malformed_and_mutated_state_force_safe);
    RUN_TEST(test_direction_polarity_and_transition_guard);
    RUN_TEST(test_runtime_state_corruption_latches_safe);
    RUN_TEST(test_force_safe_does_not_reauthorize_corruption);
    RUN_TEST(test_integer_active_cap_is_independent_fail_closed_limit);
    RUN_TEST(test_config_snapshot_integrity_precedes_pointer_use);
    RUN_TEST(test_mutated_timer_instance_uses_gpio_only_safe_path);
    RUN_TEST(test_corrupt_lifecycle_never_blocks_safe_attempt);
    RUN_TEST(test_reinit_safes_live_adapter_before_validation);
    RUN_TEST(test_primask_restore_on_apply_and_force_safe_paths);
    RUN_TEST(test_init_restores_original_primask_on_all_outcomes);
    RUN_TEST(test_pending_force_safe_runs_only_after_active_apply_commit);
    RUN_TEST(test_reverse_pending_apply_is_linearized_after_safe_operation);

#undef RUN_TEST

    printf("STM32 TB6612 HAL ordering with fake HAL: %s\n",
           pass ? "PASS" : "FAIL");
    return pass ? 0 : 1;
}
